<?php
#4.4 Власник магазину по продажі молока платить зарплату продавцю в залежності від кількості проданих літрів .
# Якщо продавець продав менше 1000л то він отримує 20відсотків зарплати від суми проданого молока ,
#якщо продавець продав +=1000л але менше 2000л то отримає 25 відсотків зарплати ,
# якщо +=2000л то отримає 30 відсотків . Створити програму яка рахує зарплату продавцю 1л=6грн.
?>

<form action="php_Part4_42.php" method="post">
    Продано л. молока <input type="number" step="1" name="v"><br>
    Зарплата за 1л. <input type="number" step="0.01" name="salary"><br>
    <input type="submit" value="Порахувати">
</form>
