<?php
#4.5 Створити програму «Ваша вага». Вхідні дані: ваша вага, ваш ріст.
#  Дія програми: 1. Якщо ваша вага є нормою, тоді на екран виводиться повідомлення: «Ваша вага нормальна.»
#2. Якщо ваша вага більше норми, тоді на екран виводиться повідомлення: «Ви важите більше норми, вам необхідно похудати на …. кг.»
#3. Якщо ваша вага менше норми, тоді на екран виводиться повідомлення: «Ви важите менше норми, вам необхідно поправитись  на …. кг.»
#Нормальна вага обчислюється за формулою:
#Норма = ріст у сантиметрах – 100
#Нормою є теж вага більша і менша на 10% від норми.
?>
<form action="php_Part4_52.php" method="post">
    Ваш вес <input type="number" name="weight"><br>
    Ваш рост <input type="number" name="width"><br>
    <input type="submit" value="Посчитать">
</form>