<?php

#9.1. Створити двовимірний масив "Inform" з оцінками учнів з інформатики:
$inform=[
    ['Ім`я учня'=>'Василь','12','н','8','н','н','10','10'],
    ['Ім`я учня'=>'Марія' ,'8','','н','','4','н','7'],
    ['Ім`я учня'=>'Ірина' ,'н','11','','н','7','','6'],
    ['Ім`я учня'=>'Петро','','8','8','9','','н','7'],
    ['Ім`я учня'=>'Саша','н','н','н','','9','н','7'],
    ['Ім`я учня'=>'Коля','9','','8','10','10','11','12'],
    ['Ім`я учня'=>'Гріша','9','','','','','7','н'],
    ['Ім`я учня'=>'Оля','н','н','','','6','',''],
    ['Ім`я учня'=>'Галя','4','5','','н','н','н','5'],
    ['Ім`я учня'=>'Тарас','10','10','8','н','11','12','9']
];