<?php
#9.1. Створити двовимірний масив "Inform" з оцінками учнів з інформатики:
function preload($var){echo "<pre>".print_r($var,true)."</pre>";}
$inform=[
    ['Имя ученика'=>'Василь','12','н','8','н','н','10','10'],
    ['Имя ученика'=>'Марія' ,'8','','н','','4','н','7'],
    ['Имя ученика'=>'Ірина' ,'н','11','','н','7','','6'],
    ['Имя ученика'=>'Петро','','8','8','9','','н','7'],
    ['Имя ученика'=>'Саша','н','н','н','','9','н','7'],
    ['Имя ученика'=>'Коля','9','','8','10','10','11','12'],
    ['Имя ученика'=>'Гріша','9','','','','','7','н'],
    ['Имя ученика'=>'Оля','н','н','','','6','',''],
    ['Имя ученика'=>'Галя','4','5','','н','н','н','5'],
    ['Имя ученика'=>'Тарас','10','10','8','н','11','12','9']
];
#preload($inform);



#9_16 Визначити учня що має найбільше пропусків.

$pupils=[];
foreach ($inform as $key1=> $value1){
    $absent=0;
    foreach ($value1 as $key2=>$value2){

        if ($value2=='н'){

            # echo $key2['Ім`я учня']."<br>";
            $absent++;
        }

    }
    echo $key1."==>".$value1['Имя ученика']."<br>";
    $pupils[$value1['Имя ученика']]=$absent;
}
preload($pupils);
# просто больше всех прогулов
$worst1=max($pupils);
#определяем студентов
$worstStudents=[];
foreach ($pupils as $key1=>$pupil)if($worst1==$pupil)$worstStudents[$key1]=$worst1;

preload($worstStudents);
$message="<h1>Самые злостные нарушители:";
foreach ($worstStudents as $name=>$value)$message.=" {$name},";
$message .=" c количеством прогулов -  {$worst1}";
echo $message;
