<?php
function preload($var){echo "<pre>".print_r($var,true)."</pre>";}
#9_18. Визначити найкращого учня. Найкращий учень - той, що має найвищий середній бал.

$inform=[
['Ім`я учня'=>'Василь','12','н','8','н','н','10','10'],
['Ім`я учня'=>'Марія' ,'8','','н','','4','н','7'],
['Ім`я учня'=>'Ірина' ,'н','11','','н','7','','6'],
['Ім`я учня'=>'Петро','','8','8','9','','н','7'],
['Ім`я учня'=>'Саша','н','н','н','','9','н','7'],
['Ім`я учня'=>'Коля','9','','8','10','10','11','12'],
['Ім`я учня'=>'Гріша','9','','','','','7','н'],
['Ім`я учня'=>'Оля','н','н','','','6','',''],
['Ім`я учня'=>'Галя','4','5','','н','н','н','5'],
['Ім`я учня'=>'Тарас','10','10','8','н','11','12','9']
];
$final=[];

foreach ($inform as $key => $value){
    $val=0;
    $count=0;
    foreach ($value as $key2=> $value2){
        if( (int)$value2){
            (int)$value2;
            $count++;
            $val+=$value2;
        }

    }
    $final[$value['Ім`я учня']]=$val/$count;
}
#preload($final);
$res=max($final);
$message="<h1>Найвищий бал - {$res}.<br> Найкращі результати у ";
foreach ($final as $key3 => $value3)if($res==$value3)$message.=" {$key3},";
echo $message;
